<?php
/**
 *  1101XXX  账号相关
 *
 */

return [
    "sms"=>[
        -1=>"余额不足",
        -2=>"帐号或密码错误",
        -3=>"连接服务商失败",
        -4=>"超时",
        -5=>"其他错误，一般为网络问题，IP受限等",
        -6=>"短信内容为空",
        -7=>"目标号码为空",
        -8=>"用户通道设置不对，需要设置三个通道",
        -9=>"捕获未知异常",
        -10	=>"超过最大定时时间限制",
        -11	=>"目标号码在黑名单里",
        -13=>"没有权限使用该网关",
        -14=>"找不到对应的Channel ID",
        -17=>"没有提交权限，客户端帐号无法使用接口提交。或非绑定IP提交",
        -18=>"提交参数名称不正确或确少参数",
        -19=>"必须为POST提交",
        -20=>"超速提交(一般为每秒一次提交)",
        -21=>"扩展参数不正确",
        -22=>"Ip 被封停",
    ],

    55555 => '身份验证失败，请重新登录', // token验证失败， 需要重新登录
    1100001 => '账号、密码、验证码不能为空！',

    1101001 => '密码错误！',     1101002 => '两次输入的密码不一致！',
    1101101 => '账号已存在！',   1101102 => '账号不存在！',  1101103 => '账号不符合规则！', 1101104 => '账号太长了，请换一个 :）',
    1101201 => '手机号已存在！', 1101202 => '手机号不存在！', 1101203 => '手机号格式不正确！',
    1101301 => '邮箱已存在！',   1101302 => '邮箱不存在！',  1101303 => '邮箱不正确！',
    1101401 => '验证码不正确！', 1101402 => '验证码已经发送请稍后再试！', 1101403 => '短信量已达每日发送上限，请联系客服！', 1101404 => '短信发送失败，错误码:', 1101405 => '短信业务类型不存在！', 1101406 => '短信请求参数错误！', 1101407 => '短信配置错误，请联系客服！',
    1101501 => '第三放登录平台不存在！',
];
